burakenez/gd32h7xx-cmake-vscode/Examples/SDIO/eMMC_readwrite/Application/Core/Src/emmc.c
    /* send CMD8(READ_SINGLE_BLOCK) to read a block */
    sdio_command_response_config(SDIO, (uint32_t)EMMC_CMD_SEND_EXT_CSD, (uint32_t)0x0, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r1_error_check(EMMC_CMD_SEND_EXT_CSD);
    if(EMMC_OK != status) {
        return status;
    }

    /* polling mode */
    while(!sdio_flag_get(SDIO, SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_DTEND)) {
        if(RESET != sdio_flag_get(SDIO, SDIO_FLAG_RFH)) {
            /* at least 8 words can be read in the FIFO */
            for(count = 0U; count < EMMC_FIFOHALF_WORDS; count++) {
                *(ptempbuff + count) = sdio_data_read(SDIO);
            }
            ptempbuff += EMMC_FIFOHALF_WORDS;
        }
    }
    /*get EXT_CSD register data */
    memcpy(emmc_extcsd, (uint8_t *)(ptempbuff - 128U), 512U);

    sdio_trans_start_disable(SDIO);
    /* whether some error occurs and return it */
    if(RESET != sdio_flag_get(SDIO, SDIO_FLAG_DTCRCERR)) {
        status = EMMC_DATA_CRC_ERROR;
        sdio_flag_clear(SDIO, SDIO_FLAG_DTCRCERR);
        return status;

    } else if(RESET != sdio_flag_get(SDIO, SDIO_FLAG_DTTMOUT)) {
        status = EMMC_DATA_TIMEOUT;
        sdio_flag_clear(SDIO, SDIO_FLAG_DTTMOUT);
        return status;

    } else if(RESET != sdio_flag_get(SDIO, SDIO_FLAG_RXORE)) {
        status = EMMC_RX_OVERRUN_ERROR;
        sdio_flag_clear(SDIO, SDIO_FLAG_RXORE);
        return status;
    }
    /* clear the SDIO_INTC flags */
    sdio_flag_clear(SDIO, SDIO_MASK_INTC_FLAGS);
    return status;
}

/*!
    \brief      get the card status whose response format R1 contains a 32-bit field
    \param[in]  none
    \param[out] pcardstatus: a pointer that store card status
    \retval     emmc_error_enum
*/
emmc_error_enum emmc_cardstatus_get(uint32_t *pcardstatus)
{
    emmc_error_enum status = EMMC_OK;
    if(NULL == pcardstatus) {
        status = EMMC_PARAMETER_INVALID;
        return status;
    }

    /* send CMD13(SEND_STATUS), addressed card sends its status register */
    sdio_command_response_config(SDIO, EMMC_CMD_SEND_STATUS, (uint32_t)emmc_rca << EMMC_RCA_SHIFT, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO, SDIO_WAITTYPE_NO);
    sdio_csm_enable(SDIO);
    /* check if some error occurs */
    status = r1_error_check(EMMC_CMD_SEND_STATUS);
    if(EMMC_OK != status) {
        return status;
    }

    *pcardstatus = sdio_response_get(SDIO, SDIO_RESPONSE0);
    return status;
}

/*!
    \brief      check if the command sent error occurs
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
static emmc_error_enum cmdsent_error_check(void)
{
    emmc_error_enum status = EMMC_OK;
    uint32_t timeout = 100000U;
    /* check command sent flag */
    while((RESET == sdio_flag_get(SDIO, SDIO_FLAG_CMDSEND)) && (timeout > 0U)) {
        --timeout;
    }
    /* command response is timeout */
    if(0U == timeout) {
        status = EMMC_CMD_RESP_TIMEOUT;
        return status;
    }
    /* if the command is sent, clear the CMD_FLAGS flags */
    sdio_flag_clear(SDIO, SDIO_MASK_CMD_FLAGS);
    return status;
}

/*!
    \brief      check if error type for R1 response
    \param[in]  resp: content of response
    \param[out] none
    \retval     emmc_error_enum
*/
static emmc_error_enum r1_error_type_check(uint32_t resp)
{
    emmc_error_enum status = EMMC_ERROR;
    /* check which error occurs */
    if(resp & EMMC_R1_OUT_OF_RANGE) {
        status = EMMC_OUT_OF_RANGE;
    } else if(resp & EMMC_R1_ADDRESS_ERROR) {
        status = EMMC_ADDRESS_ERROR;
    } else if(resp & EMMC_R1_BLOCK_LEN_ERROR) {
        status = EMMC_BLOCK_LEN_ERROR;
    } else if(resp & EMMC_R1_ERASE_SEQ_ERROR) {
        status = EMMC_ERASE_SEQ_ERROR;
    } else if(resp & EMMC_R1_ERASE_PARAM) {
        status = EMMC_ERASE_PARAM;
    } else if(resp & EMMC_R1_WP_VIOLATION) {
        status = EMMC_WP_VIOLATION;
    } else if(resp & EMMC_R1_LOCK_UNLOCK_FAILED) {
        status = EMMC_LOCK_UNLOCK_FAILED;
    } else if(resp & EMMC_R1_COM_CRC_ERROR) {
        status = EMMC_COM_CRC_ERROR;
    } else if(resp & EMMC_R1_ILLEGAL_COMMAND) {
        status = EMMC_ILLEGAL_COMMAND;
    } else if(resp & EMMC_R1_CARD_ECC_FAILED) {
        status = EMMC_CARD_ECC_FAILED;
    } else if(resp & EMMC_R1_CC_ERROR) {
        status = EMMC_CC_ERROR;
    } else if(resp & EMMC_R1_GENERAL_UNKNOWN_ERROR) {
        status = EMMC_GENERAL_UNKNOWN_ERROR;
    } else if(resp & EMMC_R1_CSD_OVERWRITE) {
        status = EMMC_CSD_OVERWRITE;
    } else if(resp & EMMC_R1_WP_ERASE_SKIP) {
        status = EMMC_WP_ERASE_SKIP;
    } else if(resp & EMMC_R1_CARD_ECC_DISABLED) {
        status = EMMC_CARD_ECC_DISABLED;
    } else if(resp & EMMC_R1_ERASE_RESET) {
        status = EMMC_ERASE_RESET;
    } else if(resp & EMMC_R1_AKE_SEQ_ERROR) {
        status = EMMC_AKE_SEQ_ERROR;
    } else {
        /*no todo,  if else end */
    }
    return status;
}

/*!
    \brief      check if error occurs for R1 response
    \param[in]  cmdindex: the index of command
    \param[out] none
    \retval     emmc_error_enum
*/
static emmc_error_enum r1_error_check(uint8_t cmdindex)
{
    emmc_error_enum status = EMMC_OK;
    uint32_t reg_status = 0U, resp_r1 = 0U;

    /* store the content of SDIO_STAT */
    reg_status = SDIO_STAT(SDIO);
    while(!(reg_status & (SDIO_FLAG_CCRCERR | SDIO_FLAG_CMDTMOUT | SDIO_FLAG_CMDRECV))) {
        reg_status = SDIO_STAT(SDIO);
    }
    /* check whether an error or timeout occurs or command response received */
    if(reg_status & SDIO_FLAG_CCRCERR) {
        status = EMMC_CMD_CRC_ERROR;
        sdio_flag_clear(SDIO, SDIO_FLAG_CCRCERR);
        return status;
    } else if(reg_status & SDIO_FLAG_CMDTMOUT) {
        status = EMMC_CMD_RESP_TIMEOUT;
        sdio_flag_clear(SDIO, SDIO_FLAG_CMDTMOUT);
        return status;
    } else {
        /* if else end */
    }

    /* check whether the last response command index is the desired one */
    if(sdio_command_index_get(SDIO) != cmdindex) {
        status = EMMC_ILLEGAL_COMMAND;
        return status;
    }
    /* clear all the CMD_FLAGS flags */
    sdio_flag_clear(SDIO, SDIO_MASK_CMD_FLAGS);
    /* get the SDIO response register 0 for checking */
    resp_r1 = sdio_response_get(SDIO, SDIO_RESPONSE0);
    if(EMMC_ALLZERO == (resp_r1 & EMMC_R1_ERROR_BITS)) {
        /* no error occurs, return EMMC_OK */
        status = EMMC_OK;
        return status;
    }

    /* if some error occurs, return the error type */
    status = r1_error_type_check(resp_r1);
    return status;
}

/*!
    \brief      check if error occurs for R2 response
    \param[in]  none
    \param[out] none
    \retval     emmc_error_enum
*/
static emmc_error_enum r2_error_check(void)
{
    emmc_error_enum status = EMMC_OK;
    uint32_t reg_status = 0U;

    /* store the content of SDIO_STAT */
    reg_status = SDIO_STAT(SDIO);
    while(!(reg_status & (SDIO_FLAG_CCRCERR | SDIO_FLAG_CMDTMOUT | SDIO_FLAG_CMDRECV))) {
        reg_status = SDIO_STAT(SDIO);
    }
    /* check whether an error or timeout occurs or command response received */
    if(reg_status & SDIO_FLAG_CCRCERR) {
        status = EMMC_CMD_CRC_ERROR;
        sdio_flag_clear(SDIO, SDIO_FLAG_CCRCERR);
        return status;
    } else if(reg_status & SDIO_FLAG_CMDTMOUT) {
        status = EMMC_CMD_RESP_TIMEOUT;
        sdio_flag_clear(SDIO, SDIO_FLAG_CMDTMOUT);
        return status;
    } else {
        /* if else end */
    }
    /* clear all the CMD_FLAGS flags */
    sdio_flag_clear(SDIO, SDIO_MASK_CMD_FLAGS);

